CalPlug/Microsemi_SmartFusion2_DigikeyBoardDemo/Espressif_ESP8266-ESP32_Applications/ESP8266/ESP8266_web_interface/libraries/ESP8266WebInterface.h
/*****************************************************************************************************/
/* 
   Simple class used to create a softAP
   Web Interface using the ESP8266.

   Reference:https://learn.sparkfun.com/tutorials/esp8266-thing-hookup-guide/example-sketch-ap-web-server	

/* Written by Paolo Caraos          															   */
/***************************************************************************************************/
#ifndef ESP8266_WEB_INTERFACE_H
#define ESP8266_WEB_INTERFACE_H

#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ESP8266WebServer.h>

#include "EMem.h"
#include "WiFiManager.h"

#define BUFFER_SIZE 128 //size of buffer outbound from UART

void debug_print(...);

class WebInterface
{
	typedef enum MODE{
		_DEBUG = 1,
		_UART
	};
	private:
		int mode = _DEBUG;
		const int MAX_LED = 8;

		/*The AP_NAME will be ESP8266 - MacID*/
		String AP_NAME;
		String AP_PASSWORD;
		String homePage;
		String message;
		String tempPage;
		String wifistat;

		String MICROSEMI_LOGO = "<img src=\"data:image/jpeg;base64,/9j/4AAQSkZJRgABAQEAYABgAAD/4QBoRXhpZgAATU0AKgAAAAgABAEaAAUAAAABAAAAPgEbAAUAAAABAAAARgEoAAMAAAABAAIAAAExAAIAAAARAAAATgAAAAAAAABgAAAAAQAAAGAAAAABcGFpbnQubmV0IDQuMC4xOQAA/9sAQwACAQECAQECAgICAgICAgMFAwMDAwMGBAQDBQcGBwcHBgcHCAkLCQgICggHBwoNCgoLDAwMDAcJDg8NDA4LDAwM/9sAQwECAgIDAwMGAwMGDAgHCAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwM/8AAEQgAHwCWAwEiAAIRAQMRAf/EAB8AAAEFAQEBAQEBAAAAAAAAAAABAgMEBQYHCAkKC//EALUQAAIBAwMCBAMFBQQEAAABfQECAwAEEQUSITFBBhNRYQcicRQygZGhCCNCscEVUtHwJDNicoIJChYXGBkaJSYnKCkqNDU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6g4SFhoeIiYqSk5SVlpeYmZqio6Slpqeoqaqys7S1tre4ubrCw8TFxsfIycrS09TV1tfY2drh4uPk5ebn6Onq8fLz9PX29/j5+v/EAB8BAAMBAQEBAQEBAQEAAAAAAAABAgMEBQYHCAkKC//EALURAAIBAgQEAwQHBQQEAAECdwABAgMRBAUhMQYSQVEHYXETIjKBCBRCkaGxwQkjM1LwFWJy0QoWJDThJfEXGBkaJicoKSo1Njc4OTpDREVGR0hJSlNUVVZXWFlaY2RlZmdoaWpzdHV2d3h5eoKDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uLj5OXm5+jp6vLz9PX29/j5+v/aAAwDAQACEQMRAD8A/fDXNdtfDmnXF7fXNvZ2drGZZp5pBHHEo6sxPAA9TXzR8SP+Ct3wt8G6xLp+kS6h4quIyUMlhEFtt2cY8xyu4e6hh6E1m/8ABRjwbZ/Gnxh4f8D6r8WdI8CWF/aeZBpT2MlzdX95JKY4JmCyIPJUqRhuNwJJ44+YvgT/AMEx/DHjr44eM/hp4x+IXi+z17wwFltp9Fa20+XWLV+s2HSUqy7lBCcYYYPBxj9ahSxFNzcZQcrSV3zbNpabXt3Pj+KqPGDlGjk2HUITV1Vmm1ZWu0rNcqel7PXQ6P4p/wDBwbqXgO7ZbH4N3GpJGW3KutO0gA9ltjWj8DP+DjPwj8Rba4m8RfDPxfoMFkC91Pps8WrLaxrt3SyIPLkSMFgC5UqMjnJr7s+EXwa8PfBPwRY+H/D2nRWen2MSwg43SzbRjfI+Mu56ljySSa8T/bh/4J5eA/2k/Dk2oWYs/BPxHs1M+h+JtOUW91b3K8p5oTBmjzwwbJ2s20gkmvrcRmmQt+/h/ZQ/m52/vv8A167GeV5XxFSw0XisUqtW2qUEot+XX8PuPYPgF+074H/ad8JLrXgfxFpviC0wvmi3fEtsSMhZI2AeM47MBntxXeb9q7mwo68npX5+/sIfspaT8GptC+JXjKw1vwH8SrET22saP4euIho+rEb4vOaBFIVJVCTeUpRFfBVVGFHun/BVH4/W/wAEP+CZXxe8Yx3DW7f8IvcWlm/RhcXai1hHHQ+ZMvI6Yz2r5apmGV1sVOhltdVOXezT5X2ut/XS/Y+twsMZ7CNTGU+Rv8f8vTU+iLPWLTUJCtvdW8zKMkRyBiB+FNudas7Kfyprq3jkOBsaQBuenFfgP/wbyWen/sVftteOtQ8WastnpMPwRtvGeo3E/C2lvOlhftn/AHI36dfxrxXwrc6p+3N/wVF+Fvxm8eSXVrB8TfGF34tXTnO6Gz8NaO26IbsYZWWyuYM8f8e5bHzjFG5/TNBqVvdTSRxzwySRHDqrhin1Hapq/FX9hj/gp9+z/wDsdfBnx98dtH8H/EqXxt8dvGc2nWXhi81WDVtT8Q3cJE0klv5cEQhgE1+EOd7FioUE8V9O/Bj/AILyXEXx6s/h38ePgf4t+A+ta9pk+raDPqF79vtdQhhieVg7CGIxsRGyjhvmwp2k0AfobRX5b/Dj/g5ci+NvgKPWfBvwH8W6sun3xHiS6m1Iw6R4V04FB9su71bd1QnMjCPaTtiJzkhTNc/8HGXiTxV4R1f4heBP2W/iV4u+C3h+WVb7xh9vS22xRkiSVIBC6sqYyx83CjO4pigD9QqK+HfjZ/wXg+F/gP8AZt+Fvjjwbo/iD4h618aJms/CXhmyVba8ubpHSKWGd3ysJSZ1iJG/cx+XcuWFP9n/AP4LH+LNX+PMngH44fs8+N/gfO2mz6xHrVxd/wBr6PBawxPK8tzcRwokCbYnG8lhuGDg0Afd1FfmPrH/AAcU6x4g8M6x8QPAP7NHxG8ZfA/w7cNDqHjdrxbMFEIWSWK28p9yLnJLSLgfe2c47r9of/g4H+H3wd1T4Hr4d8H+JviFa/HDTk1PTl0hlN9axvOIFj+zAM0sxlEkflgj54yuepAB9/UjOEXcxCgdzX5qeEP+DiC6s/2l9e+E/j39nf4jeEvHEdsk3h3QrO4TVdU12STY0ULQrGiQFo2MhfzHRVjk3MNozz+p/wDBfvSfiN8Mv2i/BXxW+EXjD4X+JPhz4ZmnvtLg1qOa6ube4nt7Dy1nMKrb3HmX9vtOyRcNuB4xQB+o1nfwajEXt5op0U7S0bhgD6cUV8k/8EN/hf4I+HX/AATp8I33w/8ADviLwvoHjSe48RLZa7qEd/flpWEaySTRxxqweKGIrhBhSo560UAU/wDgqz+wLrn7UGl2Xi7wZNI3izw/Z/ZTZfaGh+2wLI0iiM/d8xS74DYDB8blIU18F/HL48+LtYvdJ1+6bUvCfxu+HMAt573JtW8QWsYO2OVdoeG6UHAaRFilBYEgHn9vK4v4t/s5eBPjzYLb+MvCeg+Io4wfLa9tEkki/wBx8bl6diK+bzHIXVqSr4WSjKW6a0b6PupLo1+rP1jhbxNeCwlLLs0pe1p0r+zkrKcFL4o6pqcJdYS0+5W/Ov8AZ1/4LR+M/EmjWFtrn9h3FxIAjS3Nqba83DGQ8e9cN16KAe2RyfoyX9pfT/EFpHresa9p1pG0W4yXN1Fbxwr3HzMAKo+OP+CCH7M/jq9eaTwdqemtIcsun61dQKTknpvPr2rrv2dv+CO37O/7LuvR6t4V+H1oNYjYOL/ULqa9uAw6HMjEA/QV8PnXAOb5kowqY58sXdJ6q/m/1aZpnXFHDE5e3yzC+zk97RS/DmaXyOO8SePfFXxtsbXRPhVo1xqGoa0mz/hKr+2eLRNChLbWustg3bgBjHFFlHYANIqgmvA/+DlLVJvhx/wTo+HfwV8Mm71DVfHXiPTdCs455jLcXNvapuLyMeWczfZdzHqXJPNfqLb2sdpGqxxrGqjACjAApt3ptvftG00MUzRHKF0DbD6jPSvuOG+G6GUUHCHvTlbml1dv08j8zzDMJYqfM9Etkfzt/wDBTz9nzxlp/wDwVxj+A/w3ke1X4oeD/DHgm5mEbHy7CKO1EhZhysaixVnwCSiuvIY0ftrz6d8F/wBsf4/W/hW3mtfDP7PPwft/hv4ZEWWEUt6trp0rnuZT/aGoOW5YuMnnNf0RPpdu94tw0EJuFGBIUG8D69ajfw9YyNKzWdqxnOZCYlPmfXjn8a+kPPP5y/hJ8MYf+Cb3x/8A2Iviz8VNC1KT4Rx+EP7TudWt7F7iGz1G6m1C5jMqqN3mQ/a7NyMFikQ2hyhA+r/20v8Agtla/tX/ALKv7RX/AAhHwx1Bvhtpegf8I9pPxEvX+zyald3zxW32aG2eLdkiWaTHmqyxRF2QEha/YXUNAsdX077Hd2dtdWZG0wSxK8ZHptIxRB4dsLbT1tI7K0jtUxthWFRGuOmFxgUAfknpv7CPiWD/AINbY/B/gXQZbjxn4u0S18Y31pZoRd6p515FesMDmSQWixoF6kRKoBOAfLfDX/BZv4V+Dv8AgizpfwN8BaD4kvPjRfeGD4IHhKDRpvMju51aG4u94Qo4YvJIFXMjO6gquWZf3Gjt0iiVFUKijAUDgD0qjF4N0mDVWvo9M09L6T71wtuglb6tjP60D0PwJ8T/AAO+Ef7L37LnwT/Z/wD2svBfxM8C37W134p0/wCJejy7rfw/c3jLK9ntRXLsnlxRzIYyUkG5flbzK5j4BP8AHP8AaN0D9oj4H/BP4kePfjv8D7fwdK2m6trVrcW+ZUe3nS2tmmy6yyFJrdYgwWVS7bFA4/ol1XQ7PXbRre+tbe8gbrHPGsiH8CCKNL0Sz0OzW3sbW3s7dfuxwRLGg/AACgR/Ob8DPjF8I9J/YX0H4d3Xxm/axk8ZagjeG9U+D3h39yhlmkf7SsUTQbPKkMjttZzIxcKVznHtH/BNf9mnR9b/AOC6HhXwfZ2euf8ACM/s0+Aitlb655Mt5aXEged4Z2h/dGWG81iflPlDQgDJXNfuIvhLSk1dtQXTdPW/YYa5FunnMPd8Z/WrMGmW9tdSTRwQxzScO6oAz/U9TQB+R/8AwTNtbb9qT/g4A/am+L15bx3WlfD+J9A0+7nG6KBgyWSTRt0XdBY3AB/uSN/eNfmt8YfiBf8Axe+FH7Q3xAsdNvLrVvj78V7XQtGjaNjNPZxSXF/NGnH3hI+kqV6ZdemK/qYttKtrMyeTbwxeby+xAu/6461CvhrT1VQLG0ARty/uV+U8cjj2H5UAeefsYwaDoX7NHhHw34bvoNR0/wAEadB4XeaJGVRPYxpbSryBnDxsMgYPaivTbWzhsY2WGOOJWYuQihQWPJPHc0UAf//Z\">";
		String CALIT2_LOGO    = "<img src=\"data:image/jpeg;base64,/9j/4AAQSkZJRgABAQEAYQBhAAD/4QDARXhpZgAATU0AKgAAAAgABQEaAAUAAAABAAAASgEbAAUAAAABAAAAUgEoAAMAAAABAAIAAAExAAIAAAARAAAAWodpAAQAAAABAAAAbAAAAAAAAABhAAAAAQAAAGEAAAABcGFpbnQubmV0IDQuMC4xOQAAAAGShgAHAAAAOgAAAH4AAAAATABFAEEARAAgAFQAZQBjAGgAbgBvAGwAbwBnAGkAZQBzACAASQBuAGMALgAgAFYAMQAuADAAMQAAAP/bAEMAAgEBAgEBAgICAgICAgIDBQMDAwMDBgQEAwUHBgcHBwYHBwgJCwkICAoIBwcKDQoKCwwMDAwHCQ4PDQwOCwwMDP/bAEMBAgICAwMDBgMDBgwIBwgMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDP/AABEIABkAMgMBIgACEQEDEQH/xAAfAAABBQEBAQEBAQAAAAAAAAAAAQIDBAUGBwgJCgv/xAC1EAACAQMDAgQDBQUEBAAAAX0BAgMABBEFEiExQQYTUWEHInEUMoGRoQgjQrHBFVLR8CQzYnKCCQoWFxgZGiUmJygpKjQ1Njc4OTpDREVGR0hJSlNUVVZXWFlaY2RlZmdoaWpzdHV2d3h5eoOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4eLj5OXm5+jp6vHy8/T19vf4+fr/xAAfAQADAQEBAQEBAQEBAAAAAAAAAQIDBAUGBwgJCgv/xAC1EQACAQIEBAMEBwUEBAABAncAAQIDEQQFITEGEkFRB2FxEyIygQgUQpGhscEJIzNS8BVictEKFiQ04SXxFxgZGiYnKCkqNTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqCg4SFhoeIiYqSk5SVlpeYmZqio6Slpqeoqaqys7S1tre4ubrCw8TFxsfIycrS09TV1tfY2dri4+Tl5ufo6ery8/T19vf4+fr/2gAMAwEAAhEDEQA/AP36kkWCMszKqqOSeMV5H8f/ANtv4d/s2eEm1vxV4j0vSNL5WO6u5/LiuGHVYsAvOw/uwJIw7gV4Z/wU5/br/wCGU/2dvEvjq4s11GGx1ZfDPh7SJci31PVGR3Ml1t5MEaxyPsBG/wAvGRkEfz2fHv8AaG8ZftPfEa78V+OtfvvEGtXZx5tw37u3jzxFFGMLFGueEQBR6V18HZLi+JVLF0peywqk4qVk51OV2binpGN9E2m3uktGeJxHn1LKWqHLz1Wk7bKN9r9W/JWt3P218H/8F1dT/bH/AGktG+FXwB8ItqGoaxK3m+IfECm30/TreMFprg26EyyoqDjc8DM21cAsMb/xq/4KEeHPg7+05f6/a/GTxl4/0D4QeFJ7nxX4T8M+H7e6065vXl+zq1xfbwI23zpiNciP7Md0gYlH+A/+DZvx/o3g3/goneWOqSQxXnibwne6bpZfGXuFmtrgovuYoJT/AMBx3rtvjT8NvGmr/CbxpH4i8O6z4K8Y/tjfG200K0sNUsms7m00S2uPMhJRwGUGeeFcEAMsQbkEGvs8Rw7gsLjnhop8qjHVu8pcz953d7Win8NrWPn8PnGKr4RYiTvJt7KyVlotO7a3vdHtHx2/aL/aC/aO+A/h74v/AAY1j4xeFdUvk/tPVfBcmiTyaQ1i9xtjkstRuLRY3fymjdxuZCC7JhUw3n/xu/4L3fG39lT4leF9J1jS9H1i4ghkn8QaZeWEkNtLG037qO1usI8kiRqyNOFaJpMlVIGK/T39tHWvDf7O/wDwT8+IjXZg0/w7oPgy7063iY7Vx9la3ggX/aZmjRR3LCvwu/4Jyf8ABGL4oft6+J9M1zX7TVPCPw0DpJc65qCMk2oQg5KWUb8yFuQJMeWuScsRsPjYHLMPjcZDM8XJU8Nh+dcmqc3NWSbTSkorVJxcr2fNoduYYjFYaP1TDXlVq8rb0tGz1aVna/V3StdW1P3g+Ev7b/gX4sfCvwz4qgurixh8TaTa6rHbTwOZLdZ4UlCMVBG5Q+DgkZFFd94E+Feg/DXwPo3hzR9PtrPSPD9jBptjAEDeTBDGscaZOScKoGTzxRXiSlQ5nyxdvU+ijGvyrmav6Hm/7VP7Gfgv9qD4Y6x4R8X6T/bHhvW7oahJbKzxT2V4oIF3byoCY5ME5BBVtzA8Mwb81fiv/wAGyHg2G5kufDXxyu9EtSf3djrmiR3dwns0kc8XI/65V+y1V7zp+NefhcyzHJ6MoZVV9nFtvlceaKbd20rq130RWMyvB46SljKfM+97O3qj8P8AwX/wb+t8N/Guna1pf7RUWm6ro1yl3Z3mmeHQLm2mjYMjoXvo8EEA5zX6AfEf4Yaf+1B8I/C3h34oaDefE7xB4Uuo9QsdfsYrjw/cxXSABbhDYyy+VJ0J2yBCcEKuBj6y/jb61o2v+rH0r5nGZrxZnFROpmKpuOzhRgmvRtt/1sdmDyvKcFBxp4e6e6c20/kfPvh/4Aav8TLLSdM8TaPDH4a0W5F7bx61cy63dvMowshN5JNl152u43JklQCTX0LDCsEaqv3VGBTqK9LJcnngKbjVxFSvOTu5VJXfyStGK8kl53NsRXjVleMIwS6RVv8Agv5sKKKK9o5z/9k=\">";	

		void updateHomePage();

		String headerPage();
		template <typename Generic>
		void DEBUG_PRINT(Generic txt);
	public:
		WebInterface();
		void updateWiFiStatus();
		void appendMessage(String s);
		void newMessage(String s);
		void startAP(char const *pw);
		String getHomePage(boolean refresh);
		String getMessage();
	    void readSerial();
}; 
#endif